src/Documents/ИТ_УстановкаСреднихЦенТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаСреднихЦенТорговыхТочек</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_СредняяЦенаТорговыхТочек</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИТ_УстановкаСреднихЦенТорговыхТочек/Forms/ИмпортИзExcel/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЦенаПоУмолчаниюНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВводЦеныПоУмолчанию", ЭтотОбъект);
	ПоказатьВводЧисла(ОписаниеОповещения, ЦенаПоУмолчанию, "Цена которая будет использовать для торговых точек, если цена по торговой точке на задана.", 15, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводЦеныПоУмолчанию(Число, ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(Число) Тогда 
		Ошибки = "";                                                          
		ЗаписатьКонстантуСервер("ИТ_СредняяЦенаТорговыхТочекПоУмолчанию", Число, Ошибки);
		
		Если ПустаяСтрока(Ошибки) Тогда 
			ЦенаПоУмолчанию = Число;
		Иначе
			ПоказатьПредупреждение(, СтрШаблон("При установки цены произошли ошибки: %1", Ошибки), 30);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	

#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка табличного документа
	ДанныеИмпорта.Область(1, 1).Текст = "Мастер ключ торговой точки";
	ДанныеИмпорта.Область(1, 1).ШиринаКолонки = 60;
	ДанныеИмпорта.Область(1, 1).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 2).Текст = "Цена";
	ДанныеИмпорта.Область(1, 2).ШиринаКолонки = 15;
	ДанныеИмпорта.Область(1, 2).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 3).Текст = "Статус";
	ДанныеИмпорта.Область(1, 3).ШиринаКолонки = 60;
	ДанныеИмпорта.Область(1, 3).Шрифт = Новый Шрифт(,, Истина);
	
	// Заполнение данных документа
	ПериодПлана = Параметры.ПериодПлана;
	
	Для Каждого СтрокаЦены Из Параметры.Цены Цикл 
		СтрокаДанныхДокумента = ДанныеДокумента.Добавить();
		СтрокаДанныхДокумента.ТорговаяТочка = СтрокаЦены.ТорговаяТочка; 
		СтрокаДанныхДокумента.Цена = СтрокаЦены.Цена;
	КонецЦикла;	
	
	ЦенаПоУмолчанию = Константы.ИТ_СредняяЦенаТорговыхТочекПоУмолчанию.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ОбработатьДанные(Команда)
	
	ОбработатьДанныеСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИмпорт(Команда)
	
	Если ДанныеКорректны() Тогда 
		Закрыть(ДанныеДокумента);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьДанныеСервер()
	
	Для НомерСтроки = 2 По ДанныеИмпорта.ВысотаТаблицы Цикл 
		МастерКлючТорговойТочки = СокрЛП(ДанныеИмпорта.Область(НомерСтроки, 1).Текст);
		ТорговаяТочка = НайтиТорговуюТочку("ЕРПМастерКлюч", МастерКлючТорговойТочки, НомерСтроки);
		
		Если ТорговаяТочка = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		
		// Определение цены
		Цена = ПолчитьЧисло("Цена", НомерСтроки, 2);
		Если Цена = Неопределено Тогда 
			Продолжить;	
		КонецЕсли;	
		
		СтрокиДанныхДокумента = ДанныеДокумента.НайтиСтроки(Новый Структура("ТорговаяТочка", ТорговаяТочка)); 
		
		Если СтрокиДанныхДокумента.Количество() = 0 Тогда 
			СтрокаДанныхДокумента = ДанныеДокумента.Добавить();
			СтрокаДанныхДокумента.ТорговаяТочка = ТорговаяТочка;
		Иначе
			СтрокаДанныхДокумента = СтрокиДанныхДокумента.Получить(0);	
		КонецЕсли;
		
		СтрокаДанныхДокумента.Цена = Цена;
		ДополнитьСтатус(НомерСтроки, "Успешно", Ложь); 
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция НайтиТорговуюТочку(РеквизитПоиска, ЗначениеПоиска, НомерСтроки)

	СхемаЗапроса = SSL_IT_СхемыЗапросов.ПолучитьСхемуЗапроса(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИТ_ТорговыеТочки.Ссылка КАК ТорговаяТочка,
		|	ИТ_ТорговыеТочки.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ИТ_ТорговыеТочки");
	
	SSL_IT_СхемыЗапросов.ДобавитьУсловие(СтрШаблон("ИТ_ТорговыеТочки.%1 = &ЗначениеПоиска", РеквизитПоиска),,, СхемаЗапроса);
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("ЗначениеПоиска", ЗначениеПоиска);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТорговойТочки = РезультатЗапроса.Выбрать();
	
	Если ВыборкаТорговойТочки.Следующий() Тогда 
		Если ВыборкаТорговойТочки.ПометкаУдаления Тогда 
			ДополнитьСтатус(НомерСтроки, "Торговая точка помечена на удаление");
		КонецЕсли;	
		
		ТорговаяТочка = ВыборкаТорговойТочки.ТорговаяТочка;
	Иначе
		ДополнитьСтатус(НомерСтроки, "Торговая точка не найдена");
		ТорговаяТочка = Неопределено;	
	КонецЕсли;	
	
	// Возврат
	Возврат ТорговаяТочка;
	
КонецФункции	

&НаСервере
Функция ПолчитьЧисло(ИмяПоля, НомерСтроки, НомерСтолбца)
	
	СтрокаЧисла = СокрЛП(ДанныеИмпорта.Область(НомерСтроки, НомерСтолбца).Текст);
	СтрокаЧисла = СтрЗаменить(СтрокаЧисла, " ", "");
	СтрокаЧисла = СтрЗаменить(СтрокаЧисла, Символы.НПП, "");
	
	Если ПустаяСтрока(СтрокаЧисла) Тогда 
		СтрокаЧисла = "0";
	КонецЕсли;	
	
	Попытка 
		Возврат Число(СтрокаЧисла);
	Исключение
		ДополнитьСтатус(НомерСтроки, СтрШаблон("Не удалось определить число поля %1", ИмяПоля));		
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции	

&НаСервере
Процедура ДополнитьСтатус(НомерСтроки, Текст, ЭтоОшибка = Истина)
	
	КрайнийСтолбец = 3;
	ОбластьСтатуса = ДанныеИмпорта.Область(НомерСтроки, КрайнийСтолбец);
	ТекстСтатуса = СокрЛП(ОбластьСтатуса.Текст); 
	
	Если ПустаяСтрока(ТекстСтатуса) Тогда 
		ОбластьСтатуса.Текст = Текст;
	Иначе
		ОбластьСтатуса.Текст = ОбластьСтатуса.Текст + "; " + Текст;
		ЭтоОшибка = Истина;	
	КонецЕсли;	
	
	Если ЭтоОшибка Тогда 
		ДанныеИмпорта.Область(НомерСтроки, 1, НомерСтроки, КрайнийСтолбец).ЦветФона = Новый Цвет(255, 0, 0);
	Иначе
		ДанныеИмпорта.Область(НомерСтроки, 1, НомерСтроки, КрайнийСтолбец).ЦветФона = Новый Цвет(0, 255, 0);			
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Функция ДанныеКорректны()
	
	ДанныеКорректны = Истина;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДанныеДокумента.ТорговаяТочка КАК Справочник.ПодразделенияКомпании) КАК ТорговаяТочка,
		|	ДанныеДокумента.Цена КАК Цена,
		|	1 КАК Количество
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	&ДанныеДокумента КАК ДанныеДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.ТорговаяТочка.Наименование КАК НаименованиеТорговойТочки
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.ТорговаяТочка.Наименование
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеДокумента.Количество) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.ТорговаяТочка.Наименование КАК НаименованиеТорговойТочки
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|ГДЕ
		|	(ДанныеДокумента.ТорговаяТочка.ит_ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеДокумента.ТорговаяТочка.ит_ДатаОткрытия > &ПериодПлана_КонецМесяца
		|			ИЛИ ДанныеДокумента.ТорговаяТочка.ит_ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ДанныеДокумента.ТорговаяТочка.ит_ДатаЗакрытия < &ПериодПлана_НачалоМесяца)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.ТорговаяТочка.Наименование КАК НаименованиеТорговойТочки
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|ГДЕ
		|	(ДанныеДокумента.Цена = 0
		|			ИЛИ ДанныеДокумента.Цена ЕСТЬ NULL
		|			ИЛИ ДанныеДокумента.Цена = НЕОПРЕДЕЛЕНО)");
	
	Запрос.УстановитьПараметр("ДанныеДокумента", ДанныеДокумента.Выгрузить());
	Запрос.УстановитьПараметр("ПериодПлана_НачалоМесяца", НачалоМесяца(ПериодПлана));
	Запрос.УстановитьПараметр("ПериодПлана_КонецМесяца", КонецМесяца(ПериодПлана));	
			
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДублиТорговыхТочек = РезультатЗапроса.Получить(1).Выбрать();
	ЗакрытыеТорговыеТочки = РезультатЗапроса.Получить(2).Выбрать();
	ОтсутствиеЦен = РезультатЗапроса.Получить(3).Выбрать();
	МассивСообщений = Новый Массив();
	
	// Дубли
	МассивСообщений.Добавить("Удалите дубли по торговым точкам:");
	Пока ДублиТорговыхТочек.Следующий() Цикл 
		МассивСообщений.Добавить(СтрШаблон("	%1", ДублиТорговыхТочек.НаименованиеТорговойТочки));
	КонецЦикла;
	ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны);
	
	// Закрытые
	МассивСообщений.Добавить(СтрШаблон("Удалите закрытые или не открытые точки на период %1:", Формат(ПериодПлана, "ДФ='ММММ гггг'")));
	Пока ЗакрытыеТорговыеТочки.Следующий() Цикл
		МассивСообщений.Добавить(СтрШаблон("	%1", ЗакрытыеТорговыеТочки.НаименованиеТорговойТочки));	
	КонецЦикла;	
	ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны);
	
	// Отсутствие цен
	МассивСообщений.Добавить("Установите цены или удалите торговые точки:");
	Пока ОтсутствиеЦен.Следующий() Цикл
		ОтсутствиеЦен.Добавить(СтрШаблон("	%1", ОтсутствиеЦен.НаименованиеТорговойТочки));	
	КонецЦикла;	
	ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны);
	
	// Возврат 
	Возврат ДанныеКорректны;
	
КонецФункции	

&НаСервере
Процедура ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны)
	
	Если МассивСообщений.Количество() > 1 Тогда 
		ДанныеКорректны = Ложь;	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивСообщений, Символы.ПС));
	КонецЕсли;	
	
	МассивСообщений.Очистить();
	
КонецПроцедуры	

&НаСервере
Функция ЗаписатьКонстантуСервер(ИмяКонстанты, ЗначениеКонстанты, Ошибки = "")
	
	Возврат ЗаписатьКонстанту(ИмяКонстанты, ЗначениеКонстанты, Ошибки);	
	
Конецфункции


Функция ЗаписатьКонстанту(ИмяКонстанты, Значение, Ошибка = "") Экспорт
	
	Попытка
		Константы[ИмяКонстанты].Установить(Значение);
		ОбновитьПовторноИспользуемыеЗначения();	
		Возврат Истина;	
	Исключение
		Ошибка = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;	
		
КонецФункции	

#КонецОбласти
